<template>
  <div id="head">
            <section class="im">
                <img v-bind:src="intro.image">
                <header>
                    <div id="menu">
                <ul>
                    <li class="todo" v-for="todo in todos" v-bind:key="todo.id">
                        <a href="#">{{ todo.text }}</a>
                    </li>
                </ul>
                </div >
                <div class="text">
                    <h1 v-text="sitename"></h1>
                    <h3 v-text="intro.title"></h3>
                </div>
                </header>
            </section>
        
  </div>
  
  <hr>
  <div id="history">
            <h2>
                <p v-text="history.title"></p>
            </h2>
            <section>
                <p v-text="history.text"></p>
                <p v-text="history.text2"></p>
            </section>
  </div>

  <hr>
  <div id="exposition">
            <h2>
                <p v-text="exposition.title"></p>
            </h2>
            <section>
                <p v-text="exposition.text"></p>
            </section>
            <h3>
                <p v-text="space.title"></p>
            </h3>
            <section>
                <p v-text="space.text"></p>
            </section>
            <h3>
                <p v-text="cosmonautics.title"></p>
            </h3>
            <section>
                <p v-text="cosmonautics.text"></p>
                <p v-text="cosmonautics.text"></p>
                <p v-text="cosmonautics.text3"></p>
            </section>
    </div>
    <GalleryApp class="gal"></GalleryApp>
    
    
</template>

<script>
import GalleryApp from "@/components/GalleryApp";

export default{
    components: {
        GalleryApp
    },
            data() {
              return {
                todos: [
                    { id:1, text: 'Новости' },
                    { id:2, text:  'События' },
                    { id:3, text:  'Фото' }
                ],
                sitename: 'Павильон № 32 «Космос» на ВДНХ',
                intro : {
                    title: 'Центр «Космонавтика и авиация»',
                    image: "./img/file.jpg"
                },
                history : {
                    title: 'История и архитектура',
                    text: "Павильон был построен в 1938—1939 годах по проекту архитекторов Виктора Андреева, Ивана Таранова и Надежды Быковой. Изначально павильон был построен в виде эллинга, или дебаркадера, которому было придано сходство с дебаркадером Киевского вокзала в Москве. Конструкция была украшена стальными стеклянными аркадами и двухъярусными галереями-лестницами. Этот приём сохранял первоначальный план площади Механизации, спроектированной Вячеславом Олтаржевским, и создавал эффект арки, перекинутой через Большую аллею и не закрывающей перспективы до самой границы выставки.",
                    text2: "Существующий вид здание приобрело в 1954 году, во время послевоенной реконструкции выставки. Павильон был расширен путём пристройки двухэтажного зала со стеклянным куполом. Интерьер зала украшала позолоченная скульптурная композиция «Шествие советских людей к коммунизму» с развевающимся знаменем (скульптор — Николай Томский с бригадой). Входом в павильон со стороны площади служила декорированная арка с двумя постаментами-башнями, украшенными барельефами на тематику механизации и скульптурами Механизатора и Трактористки. По центру арки находился барельеф с изображением герба СССР, а над ним — профилей Ленина и Сталина, окружённых цветами, колосьями и лентами. Центральная композиция до настоящего времени не сохранилась. Во второй половине 1950-х годов изображение Сталина убрали из композиции, оставив одного Ленина. К началу 1970-х годов здание лишилось этой композиции, равно как и венчающего фриза с лепными изображениями образцов техники в медальонах. В ходе реставрации 2016—2018 годов фриз и центральная группа были восстановлены — однако уже без изображений вождей."
                },
                exposition : {
                    title: 'Экспозиции',
                    text: "Павильон был построен в 1938—1939 годах по проекту архитекторов Виктора Андреева, Ивана Таранова и Надежды Быковой. Изначально павильон был построен в виде эллинга, или дебаркадера, которому было придано сходство с дебаркадером Киевского вокзала в Москве. Конструкция была украшена стальными стеклянными аркадами и двухъярусными галереями-лестницами. Этот приём сохранял первоначальный план площади Механизации, спроектированной Вячеславом Олтаржевским, и создавал эффект арки, перекинутой через Большую аллею и не закрывающей перспективы до самой границы выставки.",
                    text2: "Существующий вид здание приобрело в 1954 году, во время послевоенной реконструкции выставки. Павильон был расширен путём пристройки двухэтажного зала со стеклянным куполом. Интерьер зала украшала позолоченная скульптурная композиция «Шествие советских людей к коммунизму» с развевающимся знаменем (скульптор — Николай Томский с бригадой). Входом в павильон со стороны площади служила декорированная арка с двумя постаментами-башнями, украшенными барельефами на тематику механизации и скульптурами Механизатора и Трактористки. По центру арки находился барельеф с изображением герба СССР, а над ним — профилей Ленина и Сталина, окружённых цветами, колосьями и лентами. Центральная композиция до настоящего времени не сохранилась. Во второй половине 1950-х годов изображение Сталина убрали из композиции, оставив одного Ленина. К началу 1970-х годов здание лишилось этой композиции, равно как и венчающего фриза с лепными изображениями образцов техники в медальонах. В ходе реставрации 2016—2018 годов фриз и центральная группа были восстановлены — однако уже без изображений вождей."
                },
                space: {
                    title: "Экспозиция «Космос»",
                    text: "С 1967 года экспозиция «Машиностроение» стала занимать только половину павильона, а в другой половине разместилась экспозиция «Космос», которая знакомила посетителей выставки с историей и новейшими достижениями Советского Союза в области освоения космоса. Демонстрировались стенды на тему развития ракетной техники, модели искусственных спутников Земли, луноходов, системы жизнеобеспечения космонавтов, подлинный спускаемый аппарат космического корабля «Восток». Скульптурная композиция «Шествие советских людей к коммунизму» была демонтирована и заменена портретом Юрия Гагарина. В 1975 году были установлены состыкованные копии космических кораблей «Союз — Аполлон».",
                },
                cosmonautics: {
                    title: "Выставочный центр «Космонавтика и авиация»",
                    text: "C 2016 года проводится реставрация павильона, планировавшаяся к завершению в марте 2018, после чего в павильоне запланировано разместить выставочный центр «Космонавтика и авиация» — совместный проект ВДНХ и Объединённой ракетно-космической корпорации. В ходе реставрации восстановлены стеклянный купол и декор здания. В 2017 году начат монтаж будущей экспозиции; в частности, в октябре в павильон был доставлен самый крупный экспонат будущего выставочного центра — макет модуля «Кристалл» орбитальной станции «Мир». Была воссоздана утраченная в 1970-е годы люстра из рубинового стекла в виде Красной звезды. В декабре 2017 года в интерьере павильона было восстановлено панно, посвящённое машиностроению, выполненное из золотой смальты.",
                    text2: "Обновлённый центр «Космонавтика и авиация» в павильоне был открыт 12 апреля 2018 года, в День космонавтики, президентом Владимиром Путиным и мэром Москвы Сергеем Собяниным, в присутствии космонавтов — Валентины Терешковой, Фёдора Юрчихина, Сергея Крикалёва и других.",
                    text3: "В 2021 году в подкупольную часть павильона вернули знаменитый портрет Юрия Гагарина с белой голубкой в руках, выставлявшийся на ВДНХ с 1983-го до середины 2010-х годов. Портрет напечатан на круглом панно диаметром 10 метров, а снимок, копия которого есть и на Международной космической станции, сделан в 1961 году во время пребывания космонавта в Болгарии."
                }
        }
    }}

</script>

<style></style>